remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_bpu.h
/**
 * \file
 *
 * \brief Component description for ARM_BPU
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_ARM_BPU_COMPONENT_
#define _SAMB11_ARM_BPU_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ARM_BPU */
/* ========================================================================== */
/** \addtogroup SAMB11_ARM_BPU ARM Breakpoint Control 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define ARM_BPU_ABP1234
#define REV_ARM_BPU                      0x100

/* -------- ARM_BPU_BP_CTRL : (ARM_BPU Offset: 0x00) (R/W 8) Break Point Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  BPU is Enabled                           */
    uint8_t  KEY:1;                     /**< bit:      1  Must Write this bit to a 1 for register write to be accepted */
    uint8_t  :2;                        /**< bit:   2..3  Reserved */
    uint8_t  NUM_CODE:4;                /**< bit:   4..7  Number of breakpoint comparators         */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_BPU_BP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_CTRL_OFFSET              0x00                                          /**<  (ARM_BPU_BP_CTRL) Break Point Control Register  Offset */
#define ARM_BPU_BP_CTRL_RESETVALUE          0x00u                                         /**<  (ARM_BPU_BP_CTRL) Break Point Control Register  Reset Value */

#define ARM_BPU_BP_CTRL_ENABLE_Pos          0                                              /**< (ARM_BPU_BP_CTRL) BPU is Enabled Position */
#define ARM_BPU_BP_CTRL_ENABLE_Msk          (0x1u << ARM_BPU_BP_CTRL_ENABLE_Pos)           /**< (ARM_BPU_BP_CTRL) BPU is Enabled Mask */
#define ARM_BPU_BP_CTRL_ENABLE              ARM_BPU_BP_CTRL_ENABLE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_BPU_BP_CTRL_ENABLE_Msk instead */
#define ARM_BPU_BP_CTRL_KEY_Pos             1                                              /**< (ARM_BPU_BP_CTRL) Must Write this bit to a 1 for register write to be accepted Position */
#define ARM_BPU_BP_CTRL_KEY_Msk             (0x1u << ARM_BPU_BP_CTRL_KEY_Pos)              /**< (ARM_BPU_BP_CTRL) Must Write this bit to a 1 for register write to be accepted Mask */
#define ARM_BPU_BP_CTRL_KEY                 ARM_BPU_BP_CTRL_KEY_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_BPU_BP_CTRL_KEY_Msk instead */
#define ARM_BPU_BP_CTRL_NUM_CODE_Pos        4                                              /**< (ARM_BPU_BP_CTRL) Number of breakpoint comparators Position */
#define ARM_BPU_BP_CTRL_NUM_CODE_Msk        (0xFu << ARM_BPU_BP_CTRL_NUM_CODE_Pos)         /**< (ARM_BPU_BP_CTRL) Number of breakpoint comparators Mask */
#define ARM_BPU_BP_CTRL_NUM_CODE(value)     (ARM_BPU_BP_CTRL_NUM_CODE_Msk & ((value) << ARM_BPU_BP_CTRL_NUM_CODE_Pos))
#define ARM_BPU_BP_CTRL_MASK                0xF3u                                          /**< \deprecated (ARM_BPU_BP_CTRL) Register MASK  (Use ARM_BPU_BP_CTRL_Msk instead)  */
#define ARM_BPU_BP_CTRL_Msk                 0xF3u                                          /**< (ARM_BPU_BP_CTRL) Register Mask  */

/* -------- ARM_BPU_BP_COMP0 : (ARM_BPU Offset: 0x08) (R/W 32) Break Point Compare Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE:1;                  /**< bit:      0  Comparator is enabled                    */
    uint32_t :1;                        /**< bit:      1  Reserved */
    uint32_t COMP:27;                   /**< bit:  2..28  Bits 28:2 of the comparison address      */
    uint32_t :1;                        /**< bit:     29  Reserved */
    uint32_t BP_MATCH:2;                /**< bit: 30..31  Behavior when the COMP address is matched */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_BPU_BP_COMP0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_COMP0_OFFSET             0x08                                          /**<  (ARM_BPU_BP_COMP0) Break Point Compare Register 0  Offset */
#define ARM_BPU_BP_COMP0_RESETVALUE         0x1FFFFFFFu                                   /**<  (ARM_BPU_BP_COMP0) Break Point Compare Register 0  Reset Value */

