remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_bpu.h
#define ARM_BPU_BP_COMP0_ENABLE_Pos         0                                              /**< (ARM_BPU_BP_COMP0) Comparator is enabled Position */
#define ARM_BPU_BP_COMP0_ENABLE_Msk         (0x1u << ARM_BPU_BP_COMP0_ENABLE_Pos)          /**< (ARM_BPU_BP_COMP0) Comparator is enabled Mask */
#define ARM_BPU_BP_COMP0_ENABLE             ARM_BPU_BP_COMP0_ENABLE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_BPU_BP_COMP0_ENABLE_Msk instead */
#define ARM_BPU_BP_COMP0_COMP_Pos           2                                              /**< (ARM_BPU_BP_COMP0) Bits 28:2 of the comparison address Position */
#define ARM_BPU_BP_COMP0_COMP_Msk           (0x7FFFFFFu << ARM_BPU_BP_COMP0_COMP_Pos)      /**< (ARM_BPU_BP_COMP0) Bits 28:2 of the comparison address Mask */
#define ARM_BPU_BP_COMP0_COMP(value)        (ARM_BPU_BP_COMP0_COMP_Msk & ((value) << ARM_BPU_BP_COMP0_COMP_Pos))
#define ARM_BPU_BP_COMP0_BP_MATCH_Pos       30                                             /**< (ARM_BPU_BP_COMP0) Behavior when the COMP address is matched Position */
#define ARM_BPU_BP_COMP0_BP_MATCH_Msk       (0x3u << ARM_BPU_BP_COMP0_BP_MATCH_Pos)        /**< (ARM_BPU_BP_COMP0) Behavior when the COMP address is matched Mask */
#define ARM_BPU_BP_COMP0_BP_MATCH(value)    (ARM_BPU_BP_COMP0_BP_MATCH_Msk & ((value) << ARM_BPU_BP_COMP0_BP_MATCH_Pos))
#define   ARM_BPU_BP_COMP0_BP_MATCH_0_Val   0x0u                                           /**< (ARM_BPU_BP_COMP0) No Breakpoint Matching  */
#define   ARM_BPU_BP_COMP0_BP_MATCH_1_Val   0x1u                                           /**< (ARM_BPU_BP_COMP0) Breakpoint on lower halfword  */
#define   ARM_BPU_BP_COMP0_BP_MATCH_2_Val   0x2u                                           /**< (ARM_BPU_BP_COMP0) Breakpoint on upper halfword  */
#define   ARM_BPU_BP_COMP0_BP_MATCH_3_Val   0x3u                                           /**< (ARM_BPU_BP_COMP0) Breakpoint on both halfwords  */
#define ARM_BPU_BP_COMP0_BP_MATCH_0         (ARM_BPU_BP_COMP0_BP_MATCH_0_Val << ARM_BPU_BP_COMP0_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP0) No Breakpoint Matching Position  */
#define ARM_BPU_BP_COMP0_BP_MATCH_1         (ARM_BPU_BP_COMP0_BP_MATCH_1_Val << ARM_BPU_BP_COMP0_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP0) Breakpoint on lower halfword Position  */
#define ARM_BPU_BP_COMP0_BP_MATCH_2         (ARM_BPU_BP_COMP0_BP_MATCH_2_Val << ARM_BPU_BP_COMP0_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP0) Breakpoint on upper halfword Position  */
#define ARM_BPU_BP_COMP0_BP_MATCH_3         (ARM_BPU_BP_COMP0_BP_MATCH_3_Val << ARM_BPU_BP_COMP0_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP0) Breakpoint on both halfwords Position  */
#define ARM_BPU_BP_COMP0_MASK               0xDFFFFFFDu                                    /**< \deprecated (ARM_BPU_BP_COMP0) Register MASK  (Use ARM_BPU_BP_COMP0_Msk instead)  */
#define ARM_BPU_BP_COMP0_Msk                0xDFFFFFFDu                                    /**< (ARM_BPU_BP_COMP0) Register Mask  */

/* -------- ARM_BPU_BP_COMP1 : (ARM_BPU Offset: 0x0c) (R/W 32) Break Point Compare Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE:1;                  /**< bit:      0  Comparator is enabled                    */
    uint32_t :1;                        /**< bit:      1  Reserved */
    uint32_t COMP:27;                   /**< bit:  2..28  Bits 28:2 of the comparison address      */
    uint32_t :1;                        /**< bit:     29  Reserved */
    uint32_t BP_MATCH:2;                /**< bit: 30..31  Behavior when the COMP address is matched */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_BPU_BP_COMP1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_COMP1_OFFSET             0x0C                                          /**<  (ARM_BPU_BP_COMP1) Break Point Compare Register 1  Offset */
#define ARM_BPU_BP_COMP1_RESETVALUE         0x1FFFFFFFu                                   /**<  (ARM_BPU_BP_COMP1) Break Point Compare Register 1  Reset Value */

#define ARM_BPU_BP_COMP1_ENABLE_Pos         0                                              /**< (ARM_BPU_BP_COMP1) Comparator is enabled Position */
#define ARM_BPU_BP_COMP1_ENABLE_Msk         (0x1u << ARM_BPU_BP_COMP1_ENABLE_Pos)          /**< (ARM_BPU_BP_COMP1) Comparator is enabled Mask */
#define ARM_BPU_BP_COMP1_ENABLE             ARM_BPU_BP_COMP1_ENABLE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_BPU_BP_COMP1_ENABLE_Msk instead */
#define ARM_BPU_BP_COMP1_COMP_Pos           2                                              /**< (ARM_BPU_BP_COMP1) Bits 28:2 of the comparison address Position */
#define ARM_BPU_BP_COMP1_COMP_Msk           (0x7FFFFFFu << ARM_BPU_BP_COMP1_COMP_Pos)      /**< (ARM_BPU_BP_COMP1) Bits 28:2 of the comparison address Mask */
#define ARM_BPU_BP_COMP1_COMP(value)        (ARM_BPU_BP_COMP1_COMP_Msk & ((value) << ARM_BPU_BP_COMP1_COMP_Pos))
#define ARM_BPU_BP_COMP1_BP_MATCH_Pos       30                                             /**< (ARM_BPU_BP_COMP1) Behavior when the COMP address is matched Position */
#define ARM_BPU_BP_COMP1_BP_MATCH_Msk       (0x3u << ARM_BPU_BP_COMP1_BP_MATCH_Pos)        /**< (ARM_BPU_BP_COMP1) Behavior when the COMP address is matched Mask */
#define ARM_BPU_BP_COMP1_BP_MATCH(value)    (ARM_BPU_BP_COMP1_BP_MATCH_Msk & ((value) << ARM_BPU_BP_COMP1_BP_MATCH_Pos))
#define   ARM_BPU_BP_COMP1_BP_MATCH_0_Val   0x0u                                           /**< (ARM_BPU_BP_COMP1) No Breakpoint Matching  */
#define   ARM_BPU_BP_COMP1_BP_MATCH_1_Val   0x1u                                           /**< (ARM_BPU_BP_COMP1) Breakpoint on lower halfword  */
#define   ARM_BPU_BP_COMP1_BP_MATCH_2_Val   0x2u                                           /**< (ARM_BPU_BP_COMP1) Breakpoint on upper halfword  */
#define   ARM_BPU_BP_COMP1_BP_MATCH_3_Val   0x3u                                           /**< (ARM_BPU_BP_COMP1) Breakpoint on both halfwords  */
#define ARM_BPU_BP_COMP1_BP_MATCH_0         (ARM_BPU_BP_COMP1_BP_MATCH_0_Val << ARM_BPU_BP_COMP1_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP1) No Breakpoint Matching Position  */
#define ARM_BPU_BP_COMP1_BP_MATCH_1         (ARM_BPU_BP_COMP1_BP_MATCH_1_Val << ARM_BPU_BP_COMP1_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP1) Breakpoint on lower halfword Position  */
#define ARM_BPU_BP_COMP1_BP_MATCH_2         (ARM_BPU_BP_COMP1_BP_MATCH_2_Val << ARM_BPU_BP_COMP1_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP1) Breakpoint on upper halfword Position  */
#define ARM_BPU_BP_COMP1_BP_MATCH_3         (ARM_BPU_BP_COMP1_BP_MATCH_3_Val << ARM_BPU_BP_COMP1_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP1) Breakpoint on both halfwords Position  */
#define ARM_BPU_BP_COMP1_MASK               0xDFFFFFFDu                                    /**< \deprecated (ARM_BPU_BP_COMP1) Register MASK  (Use ARM_BPU_BP_COMP1_Msk instead)  */
#define ARM_BPU_BP_COMP1_Msk                0xDFFFFFFDu                                    /**< (ARM_BPU_BP_COMP1) Register Mask  */

/* -------- ARM_BPU_BP_COMP2 : (ARM_BPU Offset: 0x10) (R/W 32) Break Point Compare Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE:1;                  /**< bit:      0  Comparator is enabled                    */
    uint32_t :1;                        /**< bit:      1  Reserved */
    uint32_t COMP:27;                   /**< bit:  2..28  Bits 28:2 of the comparison address      */
    uint32_t :1;                        /**< bit:     29  Reserved */
    uint32_t BP_MATCH:2;                /**< bit: 30..31  Behavior when the COMP address is matched */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_BPU_BP_COMP2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_COMP2_OFFSET             0x10                                          /**<  (ARM_BPU_BP_COMP2) Break Point Compare Register 2  Offset */
#define ARM_BPU_BP_COMP2_RESETVALUE         0x1FFFFFFFu                                   /**<  (ARM_BPU_BP_COMP2) Break Point Compare Register 2  Reset Value */

