remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_bpu.h
#define ARM_BPU_BP_COMP2_ENABLE_Pos         0                                              /**< (ARM_BPU_BP_COMP2) Comparator is enabled Position */
#define ARM_BPU_BP_COMP2_ENABLE_Msk         (0x1u << ARM_BPU_BP_COMP2_ENABLE_Pos)          /**< (ARM_BPU_BP_COMP2) Comparator is enabled Mask */
#define ARM_BPU_BP_COMP2_ENABLE             ARM_BPU_BP_COMP2_ENABLE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_BPU_BP_COMP2_ENABLE_Msk instead */
#define ARM_BPU_BP_COMP2_COMP_Pos           2                                              /**< (ARM_BPU_BP_COMP2) Bits 28:2 of the comparison address Position */
#define ARM_BPU_BP_COMP2_COMP_Msk           (0x7FFFFFFu << ARM_BPU_BP_COMP2_COMP_Pos)      /**< (ARM_BPU_BP_COMP2) Bits 28:2 of the comparison address Mask */
#define ARM_BPU_BP_COMP2_COMP(value)        (ARM_BPU_BP_COMP2_COMP_Msk & ((value) << ARM_BPU_BP_COMP2_COMP_Pos))
#define ARM_BPU_BP_COMP2_BP_MATCH_Pos       30                                             /**< (ARM_BPU_BP_COMP2) Behavior when the COMP address is matched Position */
#define ARM_BPU_BP_COMP2_BP_MATCH_Msk       (0x3u << ARM_BPU_BP_COMP2_BP_MATCH_Pos)        /**< (ARM_BPU_BP_COMP2) Behavior when the COMP address is matched Mask */
#define ARM_BPU_BP_COMP2_BP_MATCH(value)    (ARM_BPU_BP_COMP2_BP_MATCH_Msk & ((value) << ARM_BPU_BP_COMP2_BP_MATCH_Pos))
#define   ARM_BPU_BP_COMP2_BP_MATCH_0_Val   0x0u                                           /**< (ARM_BPU_BP_COMP2) No Breakpoint Matching  */
#define   ARM_BPU_BP_COMP2_BP_MATCH_1_Val   0x1u                                           /**< (ARM_BPU_BP_COMP2) Breakpoint on lower halfword  */
#define   ARM_BPU_BP_COMP2_BP_MATCH_2_Val   0x2u                                           /**< (ARM_BPU_BP_COMP2) Breakpoint on upper halfword  */
#define   ARM_BPU_BP_COMP2_BP_MATCH_3_Val   0x3u                                           /**< (ARM_BPU_BP_COMP2) Breakpoint on both halfwords  */
#define ARM_BPU_BP_COMP2_BP_MATCH_0         (ARM_BPU_BP_COMP2_BP_MATCH_0_Val << ARM_BPU_BP_COMP2_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP2) No Breakpoint Matching Position  */
#define ARM_BPU_BP_COMP2_BP_MATCH_1         (ARM_BPU_BP_COMP2_BP_MATCH_1_Val << ARM_BPU_BP_COMP2_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP2) Breakpoint on lower halfword Position  */
#define ARM_BPU_BP_COMP2_BP_MATCH_2         (ARM_BPU_BP_COMP2_BP_MATCH_2_Val << ARM_BPU_BP_COMP2_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP2) Breakpoint on upper halfword Position  */
#define ARM_BPU_BP_COMP2_BP_MATCH_3         (ARM_BPU_BP_COMP2_BP_MATCH_3_Val << ARM_BPU_BP_COMP2_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP2) Breakpoint on both halfwords Position  */
#define ARM_BPU_BP_COMP2_MASK               0xDFFFFFFDu                                    /**< \deprecated (ARM_BPU_BP_COMP2) Register MASK  (Use ARM_BPU_BP_COMP2_Msk instead)  */
#define ARM_BPU_BP_COMP2_Msk                0xDFFFFFFDu                                    /**< (ARM_BPU_BP_COMP2) Register Mask  */

/* -------- ARM_BPU_BP_COMP3 : (ARM_BPU Offset: 0x14) (R/W 32) Break Point Compare Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE:1;                  /**< bit:      0  Comparator is enabled                    */
    uint32_t :1;                        /**< bit:      1  Reserved */
    uint32_t COMP:27;                   /**< bit:  2..28  Bits 28:2 of the comparison address      */
    uint32_t :1;                        /**< bit:     29  Reserved */
    uint32_t BP_MATCH:2;                /**< bit: 30..31  Behavior when the COMP address is matched */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_BPU_BP_COMP3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_COMP3_OFFSET             0x14                                          /**<  (ARM_BPU_BP_COMP3) Break Point Compare Register 3  Offset */
#define ARM_BPU_BP_COMP3_RESETVALUE         0x1FFFFFFFu                                   /**<  (ARM_BPU_BP_COMP3) Break Point Compare Register 3  Reset Value */

#define ARM_BPU_BP_COMP3_ENABLE_Pos         0                                              /**< (ARM_BPU_BP_COMP3) Comparator is enabled Position */
#define ARM_BPU_BP_COMP3_ENABLE_Msk         (0x1u << ARM_BPU_BP_COMP3_ENABLE_Pos)          /**< (ARM_BPU_BP_COMP3) Comparator is enabled Mask */
#define ARM_BPU_BP_COMP3_ENABLE             ARM_BPU_BP_COMP3_ENABLE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_BPU_BP_COMP3_ENABLE_Msk instead */
#define ARM_BPU_BP_COMP3_COMP_Pos           2                                              /**< (ARM_BPU_BP_COMP3) Bits 28:2 of the comparison address Position */
#define ARM_BPU_BP_COMP3_COMP_Msk           (0x7FFFFFFu << ARM_BPU_BP_COMP3_COMP_Pos)      /**< (ARM_BPU_BP_COMP3) Bits 28:2 of the comparison address Mask */
#define ARM_BPU_BP_COMP3_COMP(value)        (ARM_BPU_BP_COMP3_COMP_Msk & ((value) << ARM_BPU_BP_COMP3_COMP_Pos))
#define ARM_BPU_BP_COMP3_BP_MATCH_Pos       30                                             /**< (ARM_BPU_BP_COMP3) Behavior when the COMP address is matched Position */
#define ARM_BPU_BP_COMP3_BP_MATCH_Msk       (0x3u << ARM_BPU_BP_COMP3_BP_MATCH_Pos)        /**< (ARM_BPU_BP_COMP3) Behavior when the COMP address is matched Mask */
#define ARM_BPU_BP_COMP3_BP_MATCH(value)    (ARM_BPU_BP_COMP3_BP_MATCH_Msk & ((value) << ARM_BPU_BP_COMP3_BP_MATCH_Pos))
#define   ARM_BPU_BP_COMP3_BP_MATCH_0_Val   0x0u                                           /**< (ARM_BPU_BP_COMP3) No Breakpoint Matching  */
#define   ARM_BPU_BP_COMP3_BP_MATCH_1_Val   0x1u                                           /**< (ARM_BPU_BP_COMP3) Breakpoint on lower halfword  */
#define   ARM_BPU_BP_COMP3_BP_MATCH_2_Val   0x2u                                           /**< (ARM_BPU_BP_COMP3) Breakpoint on upper halfword  */
#define   ARM_BPU_BP_COMP3_BP_MATCH_3_Val   0x3u                                           /**< (ARM_BPU_BP_COMP3) Breakpoint on both halfwords  */
#define ARM_BPU_BP_COMP3_BP_MATCH_0         (ARM_BPU_BP_COMP3_BP_MATCH_0_Val << ARM_BPU_BP_COMP3_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP3) No Breakpoint Matching Position  */
#define ARM_BPU_BP_COMP3_BP_MATCH_1         (ARM_BPU_BP_COMP3_BP_MATCH_1_Val << ARM_BPU_BP_COMP3_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP3) Breakpoint on lower halfword Position  */
#define ARM_BPU_BP_COMP3_BP_MATCH_2         (ARM_BPU_BP_COMP3_BP_MATCH_2_Val << ARM_BPU_BP_COMP3_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP3) Breakpoint on upper halfword Position  */
#define ARM_BPU_BP_COMP3_BP_MATCH_3         (ARM_BPU_BP_COMP3_BP_MATCH_3_Val << ARM_BPU_BP_COMP3_BP_MATCH_Pos)  /**< (ARM_BPU_BP_COMP3) Breakpoint on both halfwords Position  */
#define ARM_BPU_BP_COMP3_MASK               0xDFFFFFFDu                                    /**< \deprecated (ARM_BPU_BP_COMP3) Register MASK  (Use ARM_BPU_BP_COMP3_Msk instead)  */
#define ARM_BPU_BP_COMP3_Msk                0xDFFFFFFDu                                    /**< (ARM_BPU_BP_COMP3) Register Mask  */

