remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_bpu.h
/* -------- ARM_BPU_BP_PID3 : (ARM_BPU Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_BPU_BP_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_PID3_OFFSET              0xFEC                                         /**<  (ARM_BPU_BP_PID3) Peripheral ID Register 3  Offset */
#define ARM_BPU_BP_PID3_RESETVALUE          0x00u                                         /**<  (ARM_BPU_BP_PID3) Peripheral ID Register 3  Reset Value */

#define ARM_BPU_BP_PID3_CUSTOMER_MOD_NUMBER_Pos 0                                              /**< (ARM_BPU_BP_PID3) Customer Modification Number Position */
#define ARM_BPU_BP_PID3_CUSTOMER_MOD_NUMBER_Msk (0xFu << ARM_BPU_BP_PID3_CUSTOMER_MOD_NUMBER_Pos)  /**< (ARM_BPU_BP_PID3) Customer Modification Number Mask */
#define ARM_BPU_BP_PID3_CUSTOMER_MOD_NUMBER(value) (ARM_BPU_BP_PID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << ARM_BPU_BP_PID3_CUSTOMER_MOD_NUMBER_Pos))
#define ARM_BPU_BP_PID3_ECO_REV_NUMBER_Pos  4                                              /**< (ARM_BPU_BP_PID3) ECO Revision Number Position */
#define ARM_BPU_BP_PID3_ECO_REV_NUMBER_Msk  (0xFu << ARM_BPU_BP_PID3_ECO_REV_NUMBER_Pos)   /**< (ARM_BPU_BP_PID3) ECO Revision Number Mask */
#define ARM_BPU_BP_PID3_ECO_REV_NUMBER(value) (ARM_BPU_BP_PID3_ECO_REV_NUMBER_Msk & ((value) << ARM_BPU_BP_PID3_ECO_REV_NUMBER_Pos))
#define ARM_BPU_BP_PID3_MASK                0xFFu                                          /**< \deprecated (ARM_BPU_BP_PID3) Register MASK  (Use ARM_BPU_BP_PID3_Msk instead)  */
#define ARM_BPU_BP_PID3_Msk                 0xFFu                                          /**< (ARM_BPU_BP_PID3) Register Mask  */

/* -------- ARM_BPU_BP_CID0 : (ARM_BPU Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  BP_CID0:8;                 /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_BPU_BP_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_CID0_OFFSET              0xFF0                                         /**<  (ARM_BPU_BP_CID0) Component ID Register 0  Offset */
#define ARM_BPU_BP_CID0_RESETVALUE          0x0Du                                         /**<  (ARM_BPU_BP_CID0) Component ID Register 0  Reset Value */

#define ARM_BPU_BP_CID0_BP_CID0_Pos         0                                              /**< (ARM_BPU_BP_CID0)  Position */
#define ARM_BPU_BP_CID0_BP_CID0_Msk         (0xFFu << ARM_BPU_BP_CID0_BP_CID0_Pos)         /**< (ARM_BPU_BP_CID0)  Mask */
#define ARM_BPU_BP_CID0_BP_CID0(value)      (ARM_BPU_BP_CID0_BP_CID0_Msk & ((value) << ARM_BPU_BP_CID0_BP_CID0_Pos))
#define ARM_BPU_BP_CID0_MASK                0xFFu                                          /**< \deprecated (ARM_BPU_BP_CID0) Register MASK  (Use ARM_BPU_BP_CID0_Msk instead)  */
#define ARM_BPU_BP_CID0_Msk                 0xFFu                                          /**< (ARM_BPU_BP_CID0) Register Mask  */

/* -------- ARM_BPU_BP_CID1 : (ARM_BPU Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  BP_CID1:8;                 /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_BPU_BP_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_CID1_OFFSET              0xFF4                                         /**<  (ARM_BPU_BP_CID1) Component ID Register 1  Offset */
#define ARM_BPU_BP_CID1_RESETVALUE          0xE0u                                         /**<  (ARM_BPU_BP_CID1) Component ID Register 1  Reset Value */

#define ARM_BPU_BP_CID1_BP_CID1_Pos         0                                              /**< (ARM_BPU_BP_CID1)  Position */
#define ARM_BPU_BP_CID1_BP_CID1_Msk         (0xFFu << ARM_BPU_BP_CID1_BP_CID1_Pos)         /**< (ARM_BPU_BP_CID1)  Mask */
#define ARM_BPU_BP_CID1_BP_CID1(value)      (ARM_BPU_BP_CID1_BP_CID1_Msk & ((value) << ARM_BPU_BP_CID1_BP_CID1_Pos))
#define ARM_BPU_BP_CID1_MASK                0xFFu                                          /**< \deprecated (ARM_BPU_BP_CID1) Register MASK  (Use ARM_BPU_BP_CID1_Msk instead)  */
#define ARM_BPU_BP_CID1_Msk                 0xFFu                                          /**< (ARM_BPU_BP_CID1) Register Mask  */

/* -------- ARM_BPU_BP_CID2 : (ARM_BPU Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  BP_CID2:8;                 /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_BPU_BP_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_BPU_BP_CID2_OFFSET              0xFF8                                         /**<  (ARM_BPU_BP_CID2) Component ID Register 2  Offset */
#define ARM_BPU_BP_CID2_RESETVALUE          0x05u                                         /**<  (ARM_BPU_BP_CID2) Component ID Register 2  Reset Value */

#define ARM_BPU_BP_CID2_BP_CID2_Pos         0                                              /**< (ARM_BPU_BP_CID2)  Position */
#define ARM_BPU_BP_CID2_BP_CID2_Msk         (0xFFu << ARM_BPU_BP_CID2_BP_CID2_Pos)         /**< (ARM_BPU_BP_CID2)  Mask */
#define ARM_BPU_BP_CID2_BP_CID2(value)      (ARM_BPU_BP_CID2_BP_CID2_Msk & ((value) << ARM_BPU_BP_CID2_BP_CID2_Pos))
#define ARM_BPU_BP_CID2_MASK                0xFFu                                          /**< \deprecated (ARM_BPU_BP_CID2) Register MASK  (Use ARM_BPU_BP_CID2_Msk instead)  */
#define ARM_BPU_BP_CID2_Msk                 0xFFu                                          /**< (ARM_BPU_BP_CID2) Register Mask  */

/* -------- ARM_BPU_BP_CID3 : (ARM_BPU Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  BP_CID3:8;                 /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_BPU_BP_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

