remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_bpu.h
#define ARM_BPU_BP_CID3_OFFSET              0xFFC                                         /**<  (ARM_BPU_BP_CID3) Component ID Register 3  Offset */
#define ARM_BPU_BP_CID3_RESETVALUE          0xB1u                                         /**<  (ARM_BPU_BP_CID3) Component ID Register 3  Reset Value */

#define ARM_BPU_BP_CID3_BP_CID3_Pos         0                                              /**< (ARM_BPU_BP_CID3)  Position */
#define ARM_BPU_BP_CID3_BP_CID3_Msk         (0xFFu << ARM_BPU_BP_CID3_BP_CID3_Pos)         /**< (ARM_BPU_BP_CID3)  Mask */
#define ARM_BPU_BP_CID3_BP_CID3(value)      (ARM_BPU_BP_CID3_BP_CID3_Msk & ((value) << ARM_BPU_BP_CID3_BP_CID3_Pos))
#define ARM_BPU_BP_CID3_MASK                0xFFu                                          /**< \deprecated (ARM_BPU_BP_CID3) Register MASK  (Use ARM_BPU_BP_CID3_Msk instead)  */
#define ARM_BPU_BP_CID3_Msk                 0xFFu                                          /**< (ARM_BPU_BP_CID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief ARM_BPU hardware registers */
typedef struct {  /* ARM Breakpoint Control */
  RwReg8  BP_CTRL;        /**< (ARM_BPU Offset: 0x00) Break Point Control Register */
  __I  uint8_t  Reserved1[7];
  RwReg   BP_COMP0;       /**< (ARM_BPU Offset: 0x08) Break Point Compare Register 0 */
  RwReg   BP_COMP1;       /**< (ARM_BPU Offset: 0x0C) Break Point Compare Register 1 */
  RwReg   BP_COMP2;       /**< (ARM_BPU Offset: 0x10) Break Point Compare Register 2 */
  RwReg   BP_COMP3;       /**< (ARM_BPU Offset: 0x14) Break Point Compare Register 3 */
  __I  uint32_t Reserved2[1006];
  RoReg8  BP_PID4;        /**< (ARM_BPU Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved3[15];
  RoReg8  BP_PID0;        /**< (ARM_BPU Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved4[3];
  RoReg8  BP_PID1;        /**< (ARM_BPU Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved5[3];
  RoReg8  BP_PID2;        /**< (ARM_BPU Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved6[3];
  RoReg8  BP_PID3;        /**< (ARM_BPU Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved7[3];
  RoReg8  BP_CID0;        /**< (ARM_BPU Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved8[3];
  RoReg8  BP_CID1;        /**< (ARM_BPU Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved9[3];
  RoReg8  BP_CID2;        /**< (ARM_BPU Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved10[3];
  RoReg8  BP_CID3;        /**< (ARM_BPU Offset: 0xFFC) Component ID Register 3 */
} ArmBpu;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief ARM_BPU hardware registers */
typedef struct {  /* ARM Breakpoint Control */
  __IO ARM_BPU_BP_CTRL_Type           BP_CTRL;        /**< Offset: 0x00 (R/W   8) Break Point Control Register */
       RoReg8                         Reserved1[0x7];
  __IO ARM_BPU_BP_COMP0_Type          BP_COMP0;       /**< Offset: 0x08 (R/W  32) Break Point Compare Register 0 */
  __IO ARM_BPU_BP_COMP1_Type          BP_COMP1;       /**< Offset: 0x0C (R/W  32) Break Point Compare Register 1 */
  __IO ARM_BPU_BP_COMP2_Type          BP_COMP2;       /**< Offset: 0x10 (R/W  32) Break Point Compare Register 2 */
  __IO ARM_BPU_BP_COMP3_Type          BP_COMP3;       /**< Offset: 0x14 (R/W  32) Break Point Compare Register 3 */
       RoReg8                         Reserved2[0xFB8];
  __I  ARM_BPU_BP_PID4_Type           BP_PID4;        /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved3[0xF];
  __I  ARM_BPU_BP_PID0_Type           BP_PID0;        /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved4[0x3];
  __I  ARM_BPU_BP_PID1_Type           BP_PID1;        /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved5[0x3];
  __I  ARM_BPU_BP_PID2_Type           BP_PID2;        /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved6[0x3];
  __I  ARM_BPU_BP_PID3_Type           BP_PID3;        /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved7[0x3];
  __I  ARM_BPU_BP_CID0_Type           BP_CID0;        /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved8[0x3];
  __I  ARM_BPU_BP_CID1_Type           BP_CID1;        /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved9[0x3];
  __I  ARM_BPU_BP_CID2_Type           BP_CID2;        /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved10[0x3];
  __I  ARM_BPU_BP_CID3_Type           BP_CID3;        /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} ArmBpu;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_ARM_BPU_COMPONENT_ */
